app/views/articles/_form.html.erb

          <div class="col-10">
            <%= f.collection_select(:category_ids, Category.all, :id, :name,
            { prompt: "Make your category" }, { multiple: true, size: 3, class: "custom-select shadow rounded" }) %>
---
SELECT "categories".* FROM "categories"