app/controllers/application_controller.rb

  def current_user
    # if current_user, return it ||= if not, do this
    @current_user ||=User.find(session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]