app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 1)

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "woshiguan"], ["description", "woshiguanyihe"], ["created_at", "2021-03-05 08:54:50.210671"], ["updated_at", "2021-03-05 08:54:50.210671"], ["user_id", 3]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save